Repository: Hugo-Venter/Universal-Replace-Engine
Catalog: languages/universal-replace-engine-*.po
Languages: ar, de_de, fr_fr, nl_nl

source: No valid post types selected.
ar: لم يتم تحديد أنواع منشورات صالحة.
de_de: Keine gültigen Beitragstypen ausgewählt.
fr_fr: Aucun type d'article valide sélectionné.
nl_nl: Geen geldige berichttypen geselecteerd.

source: Search term cannot be empty.
ar: لا يمكن أن يكون مصطلح البحث فارغاً.
de_de: Suchbegriff darf nicht leer sein.
fr_fr: Le terme de recherche ne peut pas être vide.
nl_nl: Zoekterm mag niet leeg zijn.

source: Replaced "%2$s" with "%3$s" in %1$d post(s).
ar: تم استبدال "%2$s" بـ "%3$s" في %1$d منشور.
de_de: "%2$s" wurde durch "%3$s" in %1$d Beitrag/Beiträgen ersetzt.
fr_fr: Remplacement de « %2$s » par « %3$s » dans %1$d article(s).
nl_nl: "%2$s" vervangen door "%3$s" in %1$d bericht(en).

source: Invalid regex pattern.
ar: نمط Regex غير صالح.
de_de: Ungültiges Regex-Muster.
fr_fr: Motif regex invalide.
nl_nl: Ongeldig regex-patroon.

source: Regex error: %s
ar: خطأ Regex: %s
de_de: Regex-Fehler: %s
fr_fr: Erreur regex : %s
nl_nl: Regex-fout: %s

source: Backup & Restore - Use With Caution!
ar: النسخ الاحتياطي والاستعادة - استخدم بحذر!
de_de: Sicherung & Wiederherstellung - Mit Vorsicht verwenden!
fr_fr: Sauvegarde et restauration - À utiliser avec précaution !
nl_nl: Back-up en Herstellen - Gebruik Met Voorzichtigheid!

source: Creating backups and restoring your database are critical operations. Always ensure you have a recent working backup before making major changes.
ar: إنشاء النسخ الاحتياطية واستعادة قاعدة البيانات عمليات حرجة. تأكد دائماً من أن لديك نسخة احتياطية حديثة قبل إجراء تغييرات كبيرة.
de_de: Das Erstellen von Sicherungen und das Wiederherstellen Ihrer Datenbank sind kritische Operationen. Stellen Sie immer sicher, dass Sie eine aktuelle funktionierende Sicherung haben, bevor Sie größere Änderungen vornehmen.
fr_fr: La création de sauvegardes et la restauration de votre base de données sont des opérations critiques. Assurez-vous toujours d'avoir une sauvegarde fonctionnelle récente avant d'apporter des modifications importantes.
nl_nl: Het maken van back-ups en het herstellen van uw database zijn kritieke bewerkingen. Zorg er altijd voor dat u een recente werkende back-up heeft voordat u grote wijzigingen aanbrengt.

source: ALWAYS create a backup before proceeding
ar: قم دائماً بإنشاء نسخة احتياطية قبل المتابعة
de_de: Erstellen Sie IMMER eine Sicherung, bevor Sie fortfahren
fr_fr: TOUJOURS créer une sauvegarde avant de continuer
nl_nl: Maak ALTIJD een back-up voordat u doorgaat

source: Test on a staging site first
ar: اختبر على موقع تجريبي أولاً
de_de: Testen Sie zuerst auf einer Staging-Seite
fr_fr: Testez d'abord sur un site de préproduction
nl_nl: Test eerst op een staging-site

source: Understand what you're restoring
ar: افهم ما تقوم باستعادته
de_de: Verstehen Sie, was Sie wiederherstellen
fr_fr: Comprenez ce que vous restaurez
nl_nl: Begrijp wat u herstelt

source: Create Backup (Recommended)
ar: إنشاء نسخة احتياطية (موصى به)
de_de: Sicherung erstellen (Empfohlen)
fr_fr: Créer une sauvegarde (Recommandé)
nl_nl: Back-up Maken (Aanbevolen)

source: Tables to Backup
ar: الجداول المراد نسخها احتياطياً
de_de: Zu sichernde Tabellen
fr_fr: Tables à sauvegarder
nl_nl: Tabellen voor Back-up

source: Select All
ar: تحديد الكل
de_de: Alle auswählen
fr_fr: Tout sélectionner
nl_nl: Alles Selecteren

source: Deselect All
ar: إلغاء تحديد الكل
de_de: Alle abwählen
fr_fr: Tout désélectionner
nl_nl: Alles Deselecteren

source: Core Tables Only
ar: الجداول الأساسية فقط
de_de: Nur Kern-Tabellen
fr_fr: Tables principales uniquement
nl_nl: Alleen Kerntabellen

source: Protected
ar: محمي
de_de: Geschützt
fr_fr: Protégé
nl_nl: Beschermd

source: Comment (Optional)
ar: تعليق (اختياري)
de_de: Kommentar (Optional)
fr_fr: Commentaire (Facultatif)
nl_nl: Opmerking (Optioneel)

source: E.g., Before domain migration
ar: مثلاً، قبل نقل النطاق
de_de: Z.B. Vor Domain-Migration
fr_fr: Ex. : Avant la migration de domaine
nl_nl: Bijv., Voor domeinmigratie

source: Create Backup
ar: إنشاء نسخة احتياطية
de_de: Sicherung erstellen
fr_fr: Créer une sauvegarde
nl_nl: Back-up Maken

source: Available Backups
ar: النسخ الاحتياطية المتاحة
de_de: Verfügbare Sicherungen
fr_fr: Sauvegardes disponibles
nl_nl: Beschikbare Back-ups

source: Created
ar: تاريخ الإنشاء
de_de: Erstellt
fr_fr: Créé
nl_nl: Aangemaakt

source: Tables
ar: الجداول
de_de: Tabellen
nl_nl: Tabellen

source: Size
ar: الحجم
de_de: Größe
fr_fr: Taille
nl_nl: Grootte

source: Comment
ar: تعليق
de_de: Kommentar
fr_fr: Commentaire
nl_nl: Opmerking

source: Are you sure you want to restore this backup? This will overwrite current data!
ar: هل أنت متأكد من أنك تريد استعادة هذه النسخة الاحتياطية؟ سيؤدي هذا إلى الكتابة فوق البيانات الحالية!
de_de: Sind Sie sicher, dass Sie diese Sicherung wiederherstellen möchten? Dies überschreibt aktuelle Daten!
fr_fr: Êtes-vous sûr de vouloir restaurer cette sauvegarde ? Cela écrasera les données actuelles !
nl_nl: Weet u zeker dat u deze back-up wilt herstellen? Dit overschrijft huidige gegevens!

source: Restore
ar: استعادة
de_de: Wiederherstellen
fr_fr: Restaurer
nl_nl: Herstellen

source: Are you sure you want to delete this backup?
ar: هل أنت متأكد من أنك تريد حذف هذه النسخة الاحتياطية؟
de_de: Sind Sie sicher, dass Sie diese Sicherung löschen möchten?
fr_fr: Êtes-vous sûr de vouloir supprimer cette sauvegarde ?
nl_nl: Weet u zeker dat u deze back-up wilt verwijderen?

source: Delete
ar: حذف
de_de: Löschen
fr_fr: Supprimer
nl_nl: Verwijderen

source: Advanced Mode - Use With Caution!
ar: الوضع المتقدم - استخدم بحذر!
de_de: Erweiterter Modus - Mit Vorsicht verwenden!
fr_fr: Mode avancé - À utiliser avec précaution !
nl_nl: Geavanceerde Modus - Gebruik Met Voorzichtigheid!

source: Advanced mode allows you to search and replace across any database table, including wp_options, usermeta, and custom plugin tables. This is powerful but potentially dangerous.
ar: يتيح لك الوضع المتقدم البحث والاستبدال عبر أي جدول في قاعدة البيانات، بما في ذلك wp_options وusermeta وجداول الإضافات المخصصة. هذا قوي ولكنه خطير.
de_de: Der erweiterte Modus ermöglicht das Suchen und Ersetzen in jeder Datenbanktabelle, einschließlich wp_options, usermeta und benutzerdefinierten Plugin-Tabellen. Dies ist leistungsstark, aber potenziell gefährlich.
fr_fr: Le mode avancé vous permet de rechercher et remplacer dans n'importe quelle table de la base de données, y compris wp_options, usermeta et les tables de plugins personnalisés. C'est puissant mais potentiellement dangereux.
nl_nl: Geavanceerde modus stelt u in staat om te zoeken en te vervangen in elke databasetabel, inclusief wp_options, usermeta en aangepaste plugin-tabellen. Dit is krachtig maar potentieel gevaarlijk.

source: Be very specific with your search terms
ar: كن محدداً جداً مع مصطلحات البحث
de_de: Seien Sie sehr spezifisch mit Ihren Suchbegriffen
fr_fr: Soyez très précis avec vos termes de recherche
nl_nl: Wees zeer specifiek met uw zoektermen

source: Understand what you're changing
ar: افهم ما تقوم بتغييره
de_de: Verstehen Sie, was Sie ändern
fr_fr: Comprenez ce que vous modifiez
nl_nl: Begrijp wat u wijzigt

source: Search For
ar: البحث عن
de_de: Suchen nach
fr_fr: Rechercher
nl_nl: Zoeken Naar

source: Text to search for...
ar: النص المراد البحث عنه...
de_de: Text zum Suchen...
fr_fr: Texte à rechercher...
nl_nl: Tekst om naar te zoeken...

source: Replace With
ar: استبدال بـ
de_de: Ersetzen durch
fr_fr: Remplacer par
nl_nl: Vervangen Door

source: Replacement text...
ar: نص الاستبدال...
de_de: Ersatztext...
fr_fr: Texte de remplacement...
nl_nl: Vervangende tekst...

source: Select Tables
ar: تحديد الجداول
de_de: Tabellen auswählen
fr_fr: Sélectionner les tables
nl_nl: Selecteer Tabellen

source: Skip GUIDs (recommended)
ar: تخطي GUIDs (موصى به)
de_de: GUIDs überspringen (empfohlen)
fr_fr: Ignorer les GUID (recommandé)
nl_nl: GUID's overslaan (aanbevolen)

source: Preview Changes
ar: معاينة التغييرات
de_de: Vorschau der Änderungen
fr_fr: Prévisualiser les modifications
nl_nl: Bekijk Wijzigingen

source: Universal Replace Engine - Help & Documentation
ar: محرك الاستبدال الشامل - المساعدة والتوثيق
de_de: Universelle Ersetzungsmaschine - Hilfe & Dokumentation
fr_fr: Moteur de Remplacement Universel - Aide et documentation
nl_nl: Universal Replace Engine - Hulp en Documentatie

source: Getting Started
ar: البدء
de_de: Erste Schritte
fr_fr: Commencer
nl_nl: Aan de Slag

source: Features
ar: الميزات
de_de: Funktionen
fr_fr: Fonctionnalités
nl_nl: Functies

source: Profiles
ar: ملفات التعريف
de_de: Profile
fr_fr: Profils
nl_nl: Profielen

source: Advanced Mode
ar: الوضع المتقدم
de_de: Erweiterter Modus
fr_fr: Mode avancé
nl_nl: Geavanceerde Modus

source: Troubleshooting
ar: استكشاف الأخطاء وإصلاحها
de_de: Fehlerbehebung
fr_fr: Dépannage
nl_nl: Probleemoplossing

source: FAQ
ar: الأسئلة الشائعة
nl_nl: Veelgestelde Vragen

source: Basic Search & Replace
ar: البحث والاستبدال الأساسي
de_de: Grundlegendes Suchen & Ersetzen
fr_fr: Recherche et remplacement de base
nl_nl: Basis Zoeken en Vervangen

source: Navigate to Tools → Universal Replace Engine
ar: انتقل إلى الأدوات ← محرك الاستبدال الشامل
de_de: Navigieren Sie zu Werkzeuge → Universelle Ersetzungsmaschine
fr_fr: Accédez à Outils → Moteur de Remplacement Universel
nl_nl: Ga naar Extra → Universal Replace Engine

source: Enter your search term in the "Search For" field
ar: أدخل مصطلح البحث في حقل "البحث عن"
de_de: Geben Sie Ihren Suchbegriff in das Feld "Suchen nach" ein
fr_fr: Entrez votre terme de recherche dans le champ « Rechercher »
nl_nl: Voer uw zoekterm in het veld "Zoeken Naar" in

source: Enter the replacement text in the "Replace With" field (leave empty to just search)
ar: أدخل نص الاستبدال في حقل "استبدال بـ" (اتركه فارغاً للبحث فقط)
de_de: Geben Sie den Ersatztext in das Feld "Ersetzen durch" ein (leer lassen, um nur zu suchen)
fr_fr: Entrez le texte de remplacement dans le champ « Remplacer par » (laissez vide pour rechercher uniquement)
nl_nl: Voer de vervangende tekst in het veld "Vervangen Door" in (laat leeg om alleen te zoeken)

source: Select which post types to search in
ar: اختر أنواع المنشورات التي تريد البحث فيها
de_de: Wählen Sie aus, in welchen Beitragstypen gesucht werden soll
fr_fr: Sélectionnez les types d'articles dans lesquels rechercher
nl_nl: Selecteer in welke berichttypen u wilt zoeken

source: Click "Run Preview" to see what will change
ar: انقر على "تشغيل المعاينة" لرؤية ما سيتغير
de_de: Klicken Sie auf "Vorschau ausführen", um zu sehen, was sich ändern wird
fr_fr: Cliquez sur « Lancer la prévisualisation » pour voir ce qui va changer
nl_nl: Klik op "Voorbeeld Uitvoeren" om te zien wat er zal veranderen

source: Review the preview carefully
ar: راجع المعاينة بعناية
de_de: Überprüfen Sie die Vorschau sorgfältig
fr_fr: Examinez attentivement la prévisualisation
nl_nl: Controleer het voorbeeld zorgvuldig

source: Click "Apply Changes" to make the replacements
ar: انقر على "تطبيق التغييرات" لإجراء الاستبدالات
de_de: Klicken Sie auf "Änderungen anwenden", um die Ersetzungen vorzunehmen
fr_fr: Cliquez sur « Appliquer les modifications » pour effectuer les remplacements
nl_nl: Klik op "Wijzigingen Toepassen" om de vervangingen door te voeren

source: Pro Tip:
ar: نصيحة احترافية:
de_de: Profi-Tipp:
fr_fr: Conseil Pro :

source: Always run a preview first to avoid unexpected changes!
ar: قم دائماً بتشغيل المعاينة أولاً لتجنب التغييرات غير المتوقعة!
de_de: Führen Sie immer zuerst eine Vorschau aus, um unerwartete Änderungen zu vermeiden!
fr_fr: Lancez toujours une prévisualisation d'abord pour éviter les modifications inattendues !
nl_nl: Voer altijd eerst een voorbeeld uit om onverwachte wijzigingen te voorkomen!

source: Features Overview
ar: نظرة عامة على الميزات
de_de: Funktionsübersicht
fr_fr: Aperçu des fonctionnalités
nl_nl: Functieoverzicht

source: Content Operations
ar: عمليات المحتوى
de_de: Inhalts-Operationen
fr_fr: Opérations de contenu
nl_nl: Inhoudsbewerkingen

source: Post Content:
ar: محتوى المنشور:
de_de: Beitragsinhalt:
fr_fr: Contenu de l'article :
nl_nl: Berichtinhoud:

source: Search and replace in post/page content
ar: البحث والاستبدال في محتوى المنشورات/الصفحات
de_de: Suchen und Ersetzen in Beitrags-/Seiteninhalten
fr_fr: Rechercher et remplacer dans le contenu des articles/pages
nl_nl: Zoek en vervang in bericht-/pagina-inhoud

source: Custom Post Types:
ar: أنواع المنشورات المخصصة:
de_de: Benutzerdefinierte Beitragstypen:
fr_fr: Types d'articles personnalisés :
nl_nl: Aangepaste Berichttypen:

source: Works with any post type (products, portfolios, etc.)
ar: يعمل مع أي نوع منشور (منتجات، معارض أعمال، إلخ)
de_de: Funktioniert mit jedem Beitragstyp (Produkte, Portfolios, etc.)
fr_fr: Fonctionne avec n'importe quel type d'article (produits, portfolios, etc.)
nl_nl: Werkt met elk berichttype (producten, portfolio's, enz.)

source: Preview:
ar: المعاينة:
de_de: Vorschau:
fr_fr: Prévisualisation :
nl_nl: Voorbeeld:

source: See changes before applying them
ar: شاهد التغييرات قبل تطبيقها
de_de: Änderungen vor dem Anwenden ansehen
fr_fr: Voir les modifications avant de les appliquer
nl_nl: Zie wijzigingen voordat u ze toepast

source: Undo/Rollback:
ar: التراجع/الاستعادة:
de_de: Rückgängig/Rollback:
fr_fr: Annuler/Restaurer :
nl_nl: Ongedaan maken/Terugdraaien:

source: Reverse changes with one click
ar: عكس التغييرات بنقرة واحدة
de_de: Änderungen mit einem Klick rückgängig machen
fr_fr: Annuler les modifications en un clic
nl_nl: Draai wijzigingen terug met één klik

source: Database Operations (Advanced Mode)
ar: عمليات قاعدة البيانات (الوضع المتقدم)
de_de: Datenbankoperationen (Erweiterter Modus)
fr_fr: Opérations de base de données (Mode avancé)
nl_nl: Databasebewerkingen (Geavanceerde Modus)

source: All Tables:
ar: جميع الجداول:
de_de: Alle Tabellen:
fr_fr: Toutes les tables :
nl_nl: Alle Tabellen:

source: Search any WordPress table
ar: البحث في أي جدول ووردبريس
de_de: Jede WordPress-Tabelle durchsuchen
fr_fr: Rechercher dans n'importe quelle table WordPress
nl_nl: Doorzoek elke WordPress-tabel

source: Backup:
ar: النسخ الاحتياطي:
de_de: Sicherung:
fr_fr: Sauvegarde :

source: Create SQL backups before changes
ar: إنشاء نسخ احتياطية SQL قبل التغييرات
de_de: SQL-Sicherungen vor Änderungen erstellen
fr_fr: Créer des sauvegardes SQL avant les modifications
nl_nl: Maak SQL-back-ups vóór wijzigingen

source: Restore:
ar: الاستعادة:
de_de: Wiederherstellen:
fr_fr: Restaurer :
nl_nl: Herstellen:

source: Restore from backup if needed
ar: الاستعادة من النسخة الاحتياطية عند الحاجة
de_de: Bei Bedarf aus Sicherung wiederherstellen
fr_fr: Restaurer depuis la sauvegarde si nécessaire
nl_nl: Herstel vanuit back-up indien nodig

source: GUID Protection:
ar: حماية GUID:
de_de: GUID-Schutz:
fr_fr: Protection GUID :
nl_nl: GUID-bescherming:

source: Automatically skips WordPress GUIDs
ar: يتخطى تلقائياً GUIDs ووردبريس
de_de: Überspringt automatisch WordPress-GUIDs
fr_fr: Ignore automatiquement les GUID WordPress
nl_nl: Slaat automatisch WordPress GUID's over

source: Pro Features
ar: الميزات الاحترافية
de_de: Pro-Funktionen
fr_fr: Fonctionnalités Pro
nl_nl: Pro-functies

source: Regex Mode:
ar: وضع Regex:
de_de: Regex-Modus:
fr_fr: Mode Regex :
nl_nl: Regex-modus:

source: Use regular expressions for powerful pattern matching
ar: استخدم التعبيرات النمطية لمطابقة الأنماط القوية
de_de: Verwenden Sie reguläre Ausdrücke für leistungsstarkes Musterabgleich
fr_fr: Utiliser des expressions régulières pour une correspondance de motifs puissante
nl_nl: Gebruik reguliere expressies voor krachtige patroonherkenning

source: Unlimited Preview:
ar: معاينة غير محدودة:
de_de: Unbegrenzte Vorschau:
fr_fr: Prévisualisation illimitée :
nl_nl: Onbeperkt Voorbeeld:

source: No limit on preview results
ar: لا يوجد حد لنتائج المعاينة
de_de: Keine Begrenzung der Vorschau-Ergebnisse
fr_fr: Aucune limite sur les résultats de prévisualisation
nl_nl: Geen limiet op voorbeeldresultaten

source: Extended History:
ar: سجل موسع:
de_de: Erweiterter Verlauf:
fr_fr: Historique étendu :
nl_nl: Uitgebreide Geschiedenis:

source: Keep up to 50 operations for rollback
ar: احتفظ بما يصل إلى 50 عملية للتراجع
de_de: Bis zu 50 Operationen für Rollback speichern
fr_fr: Conserver jusqu'à 50 opérations pour restauration
nl_nl: Bewaar tot 50 bewerkingen voor terugdraaien

source: Using Saved Profiles
ar: استخدام ملفات التعريف المحفوظة
de_de: Gespeicherte Profile verwenden
fr_fr: Utilisation des profils enregistrés
nl_nl: Opgeslagen Profielen Gebruiken

source: Profiles let you save common search/replace configurations for quick reuse.
ar: تتيح لك ملفات التعريف حفظ تكوينات البحث/الاستبدال الشائعة لإعادة الاستخدام السريع.
de_de: Profile ermöglichen es Ihnen, häufige Such-/Ersetzungskonfigurationen für schnelle Wiederverwendung zu speichern.
fr_fr: Les profils vous permettent d'enregistrer des configurations courantes de recherche/remplacement pour une réutilisation rapide.
nl_nl: Met profielen kunt u veelgebruikte zoek-/vervangconfiguraties opslaan voor snel hergebruik.

source: Saving a Profile
ar: حفظ ملف تعريف
de_de: Ein Profil speichern
fr_fr: Enregistrer un profil
nl_nl: Een Profiel Opslaan

source: Configure your search/replace settings
ar: قم بتكوين إعدادات البحث/الاستبدال
de_de: Konfigurieren Sie Ihre Such-/Ersetzungseinstellungen
fr_fr: Configurez vos paramètres de recherche/remplacement
nl_nl: Configureer uw zoek-/vervanginstellingen

source: Scroll to "Save Current Settings"
ar: قم بالتمرير إلى "حفظ الإعدادات الحالية"
de_de: Scrollen Sie zu "Aktuelle Einstellungen speichern"
fr_fr: Faites défiler jusqu'à « Enregistrer les paramètres actuels »
nl_nl: Scroll naar "Huidige Instellingen Opslaan"

source: Enter a descriptive name (e.g., "Domain Migration")
ar: أدخل اسماً وصفياً (مثلاً، "نقل النطاق")
de_de: Geben Sie einen aussagekräftigen Namen ein (z.B. "Domain-Migration")
fr_fr: Entrez un nom descriptif (par ex. « Migration de domaine »)
nl_nl: Voer een beschrijvende naam in (bijv. "Domeinmigratie")

source: Click "Save Current Settings as Profile"
ar: انقر على "حفظ الإعدادات الحالية كملف تعريف"
de_de: Klicken Sie auf "Aktuelle Einstellungen als Profil speichern"
fr_fr: Cliquez sur « Enregistrer les paramètres actuels en tant que profil »
nl_nl: Klik op "Huidige Instellingen Opslaan als Profiel"

source: Loading a Profile
ar: تحميل ملف تعريف
de_de: Ein Profil laden
fr_fr: Charger un profil
nl_nl: Een Profiel Laden

source: Select a profile from the dropdown
ar: اختر ملف تعريف من القائمة المنسدلة
de_de: Wählen Sie ein Profil aus dem Dropdown-Menü
fr_fr: Sélectionnez un profil dans la liste déroulante
nl_nl: Selecteer een profiel uit het vervolgkeuzemenu

source: Click "Load"
ar: انقر على "تحميل"
de_de: Klicken Sie auf "Laden"
fr_fr: Cliquez sur « Charger »
nl_nl: Klik op "Laden"

source: Review the loaded settings
ar: راجع الإعدادات المحملة
de_de: Überprüfen Sie die geladenen Einstellungen
fr_fr: Vérifiez les paramètres chargés
nl_nl: Controleer de geladen instellingen

source: Run Preview or Apply
ar: قم بتشغيل المعاينة أو التطبيق
de_de: Vorschau ausführen oder Anwenden
fr_fr: Lancer la prévisualisation ou Appliquer
nl_nl: Voer Voorbeeld of Toepassen uit

source: Common Profile Examples
ar: أمثلة ملفات التعريف الشائعة
de_de: Häufige Profil-Beispiele
fr_fr: Exemples de profils courants
nl_nl: Veelvoorkomende Profielvoorbeelden

source: Domain Migration:
ar: نقل النطاق:
fr_fr: Migration de domaine :
nl_nl: Domeinmigratie:

source: HTTPS Migration:
ar: الترحيل إلى HTTPS:
fr_fr: Migration HTTPS :
nl_nl: HTTPS-migratie:

source: Fix Typos:
ar: إصلاح الأخطاء الإملائية:
de_de: Tippfehler beheben:
fr_fr: Corriger les fautes de frappe :
nl_nl: Typefouten Corrigeren:

source: Update Company Name:
ar: تحديث اسم الشركة:
de_de: Firmennamen aktualisieren:
fr_fr: Mettre à jour le nom de l'entreprise :
nl_nl: Bedrijfsnaam Bijwerken:

source: Advanced Database Mode
ar: وضع قاعدة البيانات المتقدم
de_de: Erweiterter Datenbankmodus
fr_fr: Mode de base de données avancé
nl_nl: Geavanceerde Databasemodus

source: Warning:
ar: تحذير:
de_de: Warnung:
fr_fr: Avertissement :
nl_nl: Waarschuwing:

source: Advanced mode can modify any database table. Always create a backup first!
ar: يمكن للوضع المتقدم تعديل أي جدول في قاعدة البيانات. قم دائماً بإنشاء نسخة احتياطية أولاً!
de_de: Der erweiterte Modus kann jede Datenbanktabelle ändern. Erstellen Sie immer zuerst eine Sicherung!
fr_fr: Le mode avancé peut modifier n'importe quelle table de base de données. Créez toujours une sauvegarde d'abord !
nl_nl: Geavanceerde modus kan elke databasetabel wijzigen. Maak altijd eerst een back-up!

source: When to Use Advanced Mode
ar: متى تستخدم الوضع المتقدم
de_de: Wann der erweiterte Modus verwendet werden sollte
fr_fr: Quand utiliser le mode avancé
nl_nl: Wanneer Geavanceerde Modus Te Gebruiken

source: Domain migrations (update siteurl, home options)
ar: نقل النطاق (تحديث siteurl، خيارات home)
de_de: Domain-Migrationen (siteurl, home-Optionen aktualisieren)
fr_fr: Migrations de domaine (mise à jour de siteurl, options home)
nl_nl: Domeinmigraties (siteurl, home-opties bijwerken)

source: Fix serialized data in post meta
ar: إصلاح البيانات المتسلسلة في حقول المنشورات
de_de: Serialisierte Daten in Beitrags-Metadaten reparieren
fr_fr: Corriger les données sérialisées dans les méta d'articles
nl_nl: Geserialiseerde gegevens in post meta corrigeren

source: Update user metadata
ar: تحديث بيانات المستخدم الوصفية
de_de: Benutzer-Metadaten aktualisieren
fr_fr: Mettre à jour les métadonnées utilisateur
nl_nl: Gebruikersmetadata bijwerken

source: Fix plugin settings after migration
ar: إصلاح إعدادات الإضافات بعد الترحيل
de_de: Plugin-Einstellungen nach Migration reparieren
fr_fr: Corriger les paramètres de plugin après migration
nl_nl: Plugin-instellingen corrigeren na migratie

source: Safe Usage
ar: الاستخدام الآمن
de_de: Sichere Verwendung
fr_fr: Utilisation sécurisée
nl_nl: Veilig Gebruik

source: Create a backup first
ar: قم بإنشاء نسخة احتياطية أولاً
de_de: Erstellen Sie zuerst eine Sicherung
fr_fr: Créer d'abord une sauvegarde
nl_nl: Maak eerst een back-up

source: Select only the tables you need to modify
ar: اختر فقط الجداول التي تحتاج إلى تعديلها
de_de: Wählen Sie nur die Tabellen aus, die Sie ändern müssen
fr_fr: Sélectionnez uniquement les tables que vous devez modifier
nl_nl: Selecteer alleen de tabellen die u moet wijzigen

source: Use very specific search terms
ar: استخدم مصطلحات بحث محددة جداً
de_de: Verwenden Sie sehr spezifische Suchbegriffe
fr_fr: Utilisez des termes de recherche très spécifiques
nl_nl: Gebruik zeer specifieke zoektermen

source: Run a preview first
ar: قم بتشغيل المعاينة أولاً
de_de: Führen Sie zuerst eine Vorschau aus
fr_fr: Lancez d'abord une prévisualisation
nl_nl: Voer eerst een voorbeeld uit

source: Test on a staging site before production
ar: اختبر على موقع تجريبي قبل الإنتاج
de_de: Testen Sie auf einer Staging-Seite vor der Produktion
fr_fr: Testez sur un site de préproduction avant la production
nl_nl: Test op een staging-site vóór productie

source: Operation Times Out
ar: انتهاء مهلة العملية
de_de: Operation läuft in Zeitüberschreitung
fr_fr: Expiration de l'opération
nl_nl: Bewerking Verloopt

source: Go to Settings and reduce the batch size
ar: انتقل إلى الإعدادات وقلل حجم الدفعة
de_de: Gehen Sie zu Einstellungen und reduzieren Sie die Stapelgröße
fr_fr: Accédez aux Paramètres et réduisez la taille des lots
nl_nl: Ga naar Instellingen en verklein de batchgrootte

source: Try Content Batch Size: 50 or Database Batch Size: 2500
ar: جرب حجم دفعة المحتوى: 50 أو حجم دفعة قاعدة البيانات: 2500
de_de: Versuchen Sie Inhalts-Stapelgröße: 50 oder Datenbank-Stapelgröße: 2500
fr_fr: Essayez Taille de lot de contenu : 50 ou Taille de lot de base de données : 2500
nl_nl: Probeer Inhoud Batchgrootte: 50 of Database Batchgrootte: 2500
