Repository: Hugo-Venter/Universal-Replace-Engine
Catalog: languages/universal-replace-engine-*.po
Languages: ar, de_de, fr_fr, nl_nl

source: Contact your host to increase PHP max_execution_time
ar: اتصل بمزود الاستضافة لزيادة max_execution_time لـ PHP
de_de: Kontaktieren Sie Ihren Hoster, um PHP max_execution_time zu erhöhen
fr_fr: Contactez votre hébergeur pour augmenter le max_execution_time de PHP
nl_nl: Neem contact op met uw host om PHP max_execution_time te verhogen

source: Memory Limit Errors
ar: أخطاء حد الذاكرة
de_de: Speicherlimit-Fehler
fr_fr: Erreurs de limite de mémoire
nl_nl: Geheugenlimiet Fouten

source: Reduce batch sizes in Settings
ar: قلل أحجام الدفعات في الإعدادات
de_de: Reduzieren Sie die Stapelgrößen in den Einstellungen
fr_fr: Réduisez les tailles de lots dans les Paramètres
nl_nl: Verklein batchgroottes in Instellingen

source: Process fewer post types at once
ar: عالج عدد أقل من أنواع المنشورات في وقت واحد
de_de: Verarbeiten Sie weniger Beitragstypen gleichzeitig
fr_fr: Traitez moins de types d'articles à la fois
nl_nl: Verwerk minder berichttypen tegelijk

source: Ask your host to increase PHP memory_limit
ar: اطلب من مزود الاستضافة زيادة memory_limit لـ PHP
de_de: Bitten Sie Ihren Hoster, PHP memory_limit zu erhöhen
fr_fr: Demandez à votre hébergeur d'augmenter la memory_limit de PHP
nl_nl: Vraag uw host om PHP memory_limit te verhogen

source: Changes Not Visible
ar: التغييرات غير مرئية
de_de: Änderungen nicht sichtbar
fr_fr: Modifications non visibles
nl_nl: Wijzigingen Niet Zichtbaar

source: Clear all caches (WordPress, plugin, CDN, browser)
ar: امسح جميع ذاكرة التخزين المؤقت (ووردبريس، الإضافة، CDN، المتصفح)
de_de: Leeren Sie alle Caches (WordPress, Plugin, CDN, Browser)
fr_fr: Videz tous les caches (WordPress, plugin, CDN, navigateur)
nl_nl: Wis alle caches (WordPress, plugin, CDN, browser)

source: For Elementor pages: Regenerate CSS in Elementor settings
ar: لصفحات Elementor: أعد إنشاء CSS في إعدادات Elementor
de_de: Für Elementor-Seiten: CSS in Elementor-Einstellungen neu generieren
fr_fr: Pour les pages Elementor : Régénérez le CSS dans les paramètres Elementor
nl_nl: Voor Elementor-pagina's: Genereer CSS opnieuw in Elementor-instellingen

source: Check the Operation History to verify changes were applied
ar: تحقق من سجل العمليات للتأكد من تطبيق التغييرات
de_de: Überprüfen Sie den Operations-Verlauf, um zu verifizieren, dass Änderungen angewendet wurden
fr_fr: Vérifiez l'Historique des opérations pour confirmer que les modifications ont été appliquées
nl_nl: Controleer de Bewerkingsgeschiedenis om te verifiëren dat wijzigingen zijn toegepast

source: Frequently Asked Questions
ar: الأسئلة الشائعة
de_de: Häufig gestellte Fragen
fr_fr: Questions fréquemment posées
nl_nl: Veelgestelde Vragen

source: Q: Can I undo changes after applying them?
ar: س: هل يمكنني التراجع عن التغييرات بعد تطبيقها؟
de_de: F: Kann ich Änderungen nach dem Anwenden rückgängig machen?
fr_fr: Q : Puis-je annuler les modifications après les avoir appliquées ?
nl_nl: V: Kan ik wijzigingen ongedaan maken nadat ik ze heb toegepast?

source: A: Yes! Click "Operation History" and use the "Undo" button to rollback. The plugin keeps your last 5 operations (free) or 50 operations (Pro).
ar: ج: نعم! انقر على "سجل العمليات" واستخدم زر "التراجع" للاستعادة. تحتفظ الإضافة بآخر 5 عمليات (مجاني) أو 50 عملية (احترافي).
de_de: A: Ja! Klicken Sie auf "Operations-Verlauf" und verwenden Sie die Schaltfläche "Rückgängig", um zurückzurollen. Das Plugin speichert Ihre letzten 5 Operationen (kostenlos) oder 50 Operationen (Pro).
fr_fr: R : Oui ! Cliquez sur « Historique des opérations » et utilisez le bouton « Annuler » pour restaurer. Le plugin conserve vos 5 dernières opérations (gratuit) ou 50 opérations (Pro).
nl_nl: A: Ja! Klik op "Bewerkingsgeschiedenis" en gebruik de knop "Ongedaan maken" om terug te draaien. De plugin bewaart uw laatste 5 bewerkingen (gratis) of 50 bewerkingen (Pro).

source: Q: Does this work with Elementor/Gutenberg?
ar: س: هل يعمل هذا مع Elementor/Gutenberg؟
de_de: F: Funktioniert dies mit Elementor/Gutenberg?
fr_fr: Q : Cela fonctionne-t-il avec Elementor/Gutenberg ?
nl_nl: V: Werkt dit met Elementor/Gutenberg?

source: A: Yes! The plugin handles serialized data and JSON correctly. For Elementor, caches are automatically cleared after changes.
ar: ج: نعم! تتعامل الإضافة مع البيانات المتسلسلة وJSON بشكل صحيح. بالنسبة لـ Elementor، يتم مسح ذاكرة التخزين المؤقت تلقائياً بعد التغييرات.
de_de: A: Ja! Das Plugin verarbeitet serialisierte Daten und JSON korrekt. Für Elementor werden Caches nach Änderungen automatisch geleert.
fr_fr: R : Oui ! Le plugin gère correctement les données sérialisées et JSON. Pour Elementor, les caches sont automatiquement vidés après les modifications.
nl_nl: A: Ja! De plugin verwerkt geserialiseerde gegevens en JSON correct. Voor Elementor worden caches automatisch gewist na wijzigingen.

source: Q: Will this break my site?
ar: س: هل سيؤدي هذا إلى تعطيل موقعي؟
de_de: F: Wird dies meine Website beschädigen?
fr_fr: Q : Cela va-t-il casser mon site ?
nl_nl: V: Zal dit mijn site kapot maken?

source: A: Not if you use it correctly! Always preview changes first, be specific with search terms, and test on staging before production. The undo feature provides additional safety.
ar: ج: ليس إذا استخدمته بشكل صحيح! قم دائماً بمعاينة التغييرات أولاً، كن محدداً مع مصطلحات البحث، واختبر على موقع تجريبي قبل الإنتاج. توفر ميزة التراجع أماناً إضافياً.
de_de: A: Nicht, wenn Sie es korrekt verwenden! Zeigen Sie immer zuerst eine Vorschau der Änderungen an, seien Sie spezifisch mit Suchbegriffen und testen Sie auf Staging vor der Produktion. Die Rückgängig-Funktion bietet zusätzliche Sicherheit.
fr_fr: R : Non, si vous l'utilisez correctement ! Prévisualisez toujours les modifications d'abord, soyez précis avec les termes de recherche et testez en préproduction avant la production. La fonction d'annulation offre une sécurité supplémentaire.
nl_nl: A: Niet als u het correct gebruikt! Bekijk altijd eerst wijzigingen, wees specifiek met zoektermen en test op staging vóór productie. De ongedaan maken-functie biedt extra veiligheid.

source: Q: What's the difference between Content and Advanced mode?
ar: س: ما الفرق بين وضع المحتوى والوضع المتقدم؟
de_de: F: Was ist der Unterschied zwischen Inhalts- und Erweitertem Modus?
fr_fr: Q : Quelle est la différence entre le mode Contenu et le mode Avancé ?
nl_nl: V: Wat is het verschil tussen Inhoud en Geavanceerde modus?

source: A: Content mode searches only post/page content. Advanced mode searches any database table (wp_options, postmeta, usermeta, etc.). Advanced mode requires more caution.
ar: ج: يبحث وضع المحتوى في محتوى المنشورات/الصفحات فقط. يبحث الوضع المتقدم في أي جدول قاعدة بيانات (wp_options، postmeta، usermeta، إلخ). يتطلب الوضع المتقدم مزيداً من الحذر.
de_de: A: Der Inhaltsmodus durchsucht nur Beitrags-/Seiteninhalte. Der erweiterte Modus durchsucht jede Datenbanktabelle (wp_options, postmeta, usermeta, etc.). Der erweiterte Modus erfordert mehr Vorsicht.
fr_fr: R : Le mode Contenu recherche uniquement le contenu des articles/pages. Le mode Avancé recherche dans n'importe quelle table de base de données (wp_options, postmeta, usermeta, etc.). Le mode Avancé nécessite plus de prudence.
nl_nl: A: Inhoudmodus doorzoekt alleen bericht-/pagina-inhoud. Geavanceerde modus doorzoekt elke databasetabel (wp_options, postmeta, usermeta, enz.). Geavanceerde modus vereist meer voorzichtigheid.

source: Q: Can I use this for domain migrations?
ar: س: هل يمكنني استخدام هذا لنقل النطاق؟
de_de: F: Kann ich dies für Domain-Migrationen verwenden?
fr_fr: Q : Puis-je utiliser ceci pour les migrations de domaine ?
nl_nl: V: Kan ik dit gebruiken voor domeinmigraties?

source: A: Yes! Use Advanced mode, create a backup first, then replace old URLs with new ones across wp_options and wp_posts tables. Save this as a profile for future use.
ar: ج: نعم! استخدم الوضع المتقدم، قم بإنشاء نسخة احتياطية أولاً، ثم استبدل عناوين URL القديمة بأخرى جديدة عبر جداول wp_options وwp_posts. احفظ هذا كملف تعريف للاستخدام المستقبلي.
de_de: A: Ja! Verwenden Sie den erweiterten Modus, erstellen Sie zuerst eine Sicherung, und ersetzen Sie dann alte URLs durch neue in den Tabellen wp_options und wp_posts. Speichern Sie dies als Profil für zukünftige Verwendung.
fr_fr: R : Oui ! Utilisez le mode Avancé, créez d'abord une sauvegarde, puis remplacez les anciennes URL par les nouvelles dans les tables wp_options et wp_posts. Enregistrez ceci comme profil pour une utilisation future.
nl_nl: A: Ja! Gebruik Geavanceerde modus, maak eerst een back-up en vervang vervolgens oude URL's met nieuwe in wp_options en wp_posts tabellen. Sla dit op als profiel voor toekomstig gebruik.

source: Q: How do I upgrade to Pro?
ar: س: كيف يمكنني الترقية إلى النسخة الاحترافية؟
de_de: F: Wie kann ich auf Pro upgraden?
fr_fr: Q : Comment passer à la version Pro ?
nl_nl: V: Hoe kan ik upgraden naar Pro?

source: A: Contact the plugin developer for Pro licensing. Pro includes regex mode, unlimited previews, and extended history.
ar: ج: اتصل بمطور الإضافة للحصول على الترخيص الاحترافي. تتضمن النسخة الاحترافية وضع regex، ومعاينات غير محدودة، وسجل موسع.
de_de: A: Kontaktieren Sie den Plugin-Entwickler für Pro-Lizenzierung. Pro umfasst Regex-Modus, unbegrenzte Vorschauen und erweiterten Verlauf.
fr_fr: R : Contactez le développeur du plugin pour une licence Pro. La version Pro inclut le mode regex, des prévisualisations illimitées et un historique étendu.
nl_nl: A: Neem contact op met de plugin-ontwikkelaar voor Pro-licenties. Pro omvat regex-modus, onbeperkte voorbeelden en uitgebreide geschiedenis.

source: ↑ Back to Top
ar: ↑ العودة إلى الأعلى
de_de: ↑ Zurück nach oben
fr_fr: ↑ Retour en haut
nl_nl: ↑ Terug naar Boven

source: Saved Profiles
ar: ملفات التعريف المحفوظة
de_de: Gespeicherte Profile
fr_fr: Profils enregistrés
nl_nl: Opgeslagen Profielen

source: Load Profile:
ar: تحميل ملف التعريف:
de_de: Profil laden:
fr_fr: Charger le profil :
nl_nl: Profiel Laden:

source: -- Select Profile --
ar: -- اختر ملف التعريف --
de_de: -- Profil auswählen --
fr_fr: -- Sélectionnez un profil --
nl_nl: -- Selecteer Profiel --

source: Load
ar: تحميل
de_de: Laden
fr_fr: Charger
nl_nl: Laden

source: Are you sure you want to delete this profile?
ar: هل أنت متأكد من أنك تريد حذف ملف التعريف هذا؟
de_de: Sind Sie sicher, dass Sie dieses Profil löschen möchten?
fr_fr: Êtes-vous sûr de vouloir supprimer ce profil ?
nl_nl: Weet u zeker dat u dit profiel wilt verwijderen?

source: View All Profiles
ar: عرض جميع ملفات التعريف
de_de: Alle Profile anzeigen
fr_fr: Voir tous les profils
nl_nl: Alle Profielen Bekijken

source: Name
ar: الاسم
fr_fr: Nom
nl_nl: Naam

source: Search
ar: بحث
de_de: Suchen
fr_fr: Rechercher
nl_nl: Zoeken

source: Replace
ar: استبدال
de_de: Ersetzen
fr_fr: Remplacer
nl_nl: Vervangen

source: Updated
ar: تم التحديث
de_de: Aktualisiert
fr_fr: Mis à jour
nl_nl: Bijgewerkt

source: Case Sensitive
ar: حساس لحالة الأحرف
de_de: Groß-/Kleinschreibung beachten
fr_fr: Sensible à la casse
nl_nl: Hoofdlettergevoelig

source: Regex Mode
ar: وضع Regex
de_de: Regex-Modus
fr_fr: Mode Regex
nl_nl: Regex-modus

source: No saved profiles yet. Complete a search below and click "Save Profile" to save it for future use.
ar: لا توجد ملفات تعريف محفوظة بعد. أكمل البحث أدناه وانقر على "حفظ ملف التعريف" لحفظه للاستخدام المستقبلي.
de_de: Noch keine gespeicherten Profile. Führen Sie unten eine Suche durch und klicken Sie auf "Profil speichern", um es für zukünftige Verwendung zu speichern.
fr_fr: Aucun profil enregistré pour le moment. Effectuez une recherche ci-dessous et cliquez sur « Enregistrer le profil » pour l'enregistrer pour une utilisation future.
nl_nl: Nog geen opgeslagen profielen. Voltooi een zoekopdracht hieronder en klik op "Profiel Opslaan" om het op te slaan voor toekomstig gebruik.

source: Save Current Settings
ar: حفظ الإعدادات الحالية
de_de: Aktuelle Einstellungen speichern
fr_fr: Enregistrer les paramètres actuels
nl_nl: Huidige Instellingen Opslaan

source: Profile name (e.g., "Domain Migration")
ar: اسم ملف التعريف (مثلاً، "نقل النطاق")
de_de: Profilname (z.B. "Domain-Migration")
fr_fr: Nom du profil (par ex. « Migration de domaine »)
nl_nl: Profielnaam (bijv. "Domeinmigratie")

source: Save Current Settings as Profile
ar: حفظ الإعدادات الحالية كملف تعريف
de_de: Aktuelle Einstellungen als Profil speichern
fr_fr: Enregistrer les paramètres actuels en tant que profil
nl_nl: Huidige Instellingen Opslaan als Profiel

source: Universal Replace Engine - Settings
ar: محرك الاستبدال الشامل - الإعدادات
de_de: Universelle Ersetzungsmaschine - Einstellungen
fr_fr: Moteur de Remplacement Universel - Paramètres
nl_nl: Universal Replace Engine - Instellingen

source: Performance Settings
ar: إعدادات الأداء
de_de: Leistungseinstellungen
fr_fr: Paramètres de performance
nl_nl: Prestatie-instellingen

source: Configure batch sizes to optimize performance for your server. Lower values use less memory but take longer.
ar: قم بتكوين أحجام الدفعات لتحسين الأداء لخادمك. القيم المنخفضة تستخدم ذاكرة أقل ولكنها تستغرق وقتاً أطول.
de_de: Konfigurieren Sie Stapelgrößen, um die Leistung für Ihren Server zu optimieren. Niedrigere Werte verwenden weniger Speicher, dauern aber länger.
fr_fr: Configurez les tailles de lots pour optimiser les performances de votre serveur. Des valeurs plus basses utilisent moins de mémoire mais prennent plus de temps.
nl_nl: Configureer batchgroottes om de prestaties voor uw server te optimaliseren. Lagere waarden gebruiken minder geheugen maar duren langer.

source: Content Batch Size
ar: حجم دفعة المحتوى
de_de: Inhalts-Stapelgröße
fr_fr: Taille de lot de contenu
nl_nl: Inhoud Batchgrootte

source: Number of posts to process per batch for content operations (10-1000). Default: 100
ar: عدد المنشورات المراد معالجتها لكل دفعة لعمليات المحتوى (10-1000). الافتراضي: 100
de_de: Anzahl der Beiträge, die pro Stapel für Inhaltsoperationen verarbeitet werden (10-1000). Standard: 100
fr_fr: Nombre d'articles à traiter par lot pour les opérations de contenu (10-1000). Par défaut : 100
nl_nl: Aantal berichten om per batch te verwerken voor inhoudsbewerkingen (10-1000). Standaard: 100

source: Database Batch Size
ar: حجم دفعة قاعدة البيانات
de_de: Datenbank-Stapelgröße
fr_fr: Taille de lot de base de données
nl_nl: Database Batchgrootte

source: Number of rows to process per batch for database operations (100-10000). Default: 5000
ar: عدد الصفوف المراد معالجتها لكل دفعة لعمليات قاعدة البيانات (100-10000). الافتراضي: 5000
de_de: Anzahl der Zeilen, die pro Stapel für Datenbankoperationen verarbeitet werden (100-10000). Standard: 5000
fr_fr: Nombre de lignes à traiter par lot pour les opérations de base de données (100-10000). Par défaut : 5000
nl_nl: Aantal rijen om per batch te verwerken voor databasebewerkingen (100-10000). Standaard: 5000

source: Backup Batch Size
ar: حجم دفعة النسخ الاحتياطي
de_de: Sicherungs-Stapelgröße
fr_fr: Taille de lot de sauvegarde
nl_nl: Back-up Batchgrootte

source: Number of rows to backup per batch (100-5000). Default: 1000
ar: عدد الصفوف المراد نسخها احتياطياً لكل دفعة (100-5000). الافتراضي: 1000
de_de: Anzahl der Zeilen, die pro Stapel gesichert werden (100-5000). Standard: 1000
fr_fr: Nombre de lignes à sauvegarder par lot (100-5000). Par défaut : 1000
nl_nl: Aantal rijen om per batch een back-up van te maken (100-5000). Standaard: 1000

source: Preview & History Settings
ar: إعدادات المعاينة والسجل
de_de: Vorschau- & Verlaufseinstellungen
fr_fr: Paramètres de prévisualisation et d'historique
nl_nl: Voorbeeld- en Geschiedenisinstellingen

source: Max Preview Results
ar: الحد الأقصى لنتائج المعاينة
de_de: Max. Vorschau-Ergebnisse
fr_fr: Résultats de prévisualisation maximum
nl_nl: Max. Voorbeeldresultaten

source: Pro: Unlimited
ar: احترافي: غير محدود
de_de: Pro: Unbegrenzt
fr_fr: Pro : Illimité
nl_nl: Pro: Onbeperkt

source: Maximum number of results to show in preview (1-100).
ar: الحد الأقصى لعدد النتائج المراد عرضها في المعاينة (1-100).
de_de: Maximale Anzahl von Ergebnissen, die in der Vorschau angezeigt werden (1-100).
fr_fr: Nombre maximum de résultats à afficher dans la prévisualisation (1-100).
nl_nl: Maximaal aantal resultaten om in voorbeeld te tonen (1-100).

source: Maximum number of results to show in preview (1-50). Pro version removes this limit.
ar: الحد الأقصى لعدد النتائج المراد عرضها في المعاينة (1-50). تزيل النسخة الاحترافية هذا الحد.
de_de: Maximale Anzahl von Ergebnissen, die in der Vorschau angezeigt werden (1-50). Die Pro-Version entfernt dieses Limit.
fr_fr: Nombre maximum de résultats à afficher dans la prévisualisation (1-50). La version Pro supprime cette limite.
nl_nl: Maximaal aantal resultaten om in voorbeeld te tonen (1-50). Pro-versie verwijdert deze limiet.

source: Operation History Limit
ar: حد سجل العمليات
de_de: Operations-Verlaufslimit
fr_fr: Limite de l'historique des opérations
nl_nl: Bewerkingsgeschiedenislimiet

source: Pro: 50
ar: احترافي: 50

source: Number of operations to keep in history for rollback (1-50).
ar: عدد العمليات المراد الاحتفاظ بها في السجل للتراجع (1-50).
de_de: Anzahl der Operationen, die im Verlauf für Rollback gespeichert werden (1-50).
fr_fr: Nombre d'opérations à conserver dans l'historique pour restauration (1-50).
nl_nl: Aantal bewerkingen om in geschiedenis te bewaren voor terugdraaien (1-50).

source: Number of operations to keep in history for rollback (1-10). Pro version keeps up to 50.
ar: عدد العمليات المراد الاحتفاظ بها في السجل للتراجع (1-10). تحتفظ النسخة الاحترافية بما يصل إلى 50.
de_de: Anzahl der Operationen, die im Verlauf für Rollback gespeichert werden (1-10). Die Pro-Version speichert bis zu 50.
fr_fr: Nombre d'opérations à conserver dans l'historique pour restauration (1-10). La version Pro conserve jusqu'à 50.
nl_nl: Aantal bewerkingen om in geschiedenis te bewaren voor terugdraaien (1-10). Pro-versie bewaart tot 50.

source: Backup Settings
ar: إعدادات النسخ الاحتياطي
de_de: Sicherungseinstellungen
fr_fr: Paramètres de sauvegarde
nl_nl: Back-upinstellingen

source: Backup Retention
ar: الاحتفاظ بالنسخ الاحتياطية
de_de: Sicherungsaufbewahrung
fr_fr: Rétention des sauvegardes
nl_nl: Back-upbewaarperiode

source: days
ar: أيام
de_de: Tage
fr_fr: jours
nl_nl: dagen

source: Automatically delete backups older than this many days (1-30). Default: 7
ar: حذف النسخ الاحتياطية الأقدم من هذا العدد من الأيام تلقائياً (1-30). الافتراضي: 7
de_de: Sicherungen automatisch löschen, die älter als diese Anzahl von Tagen sind (1-30). Standard: 7
fr_fr: Supprimer automatiquement les sauvegardes de plus de ce nombre de jours (1-30). Par défaut : 7
nl_nl: Verwijder automatisch back-ups ouder dan dit aantal dagen (1-30). Standaard: 7

source: Feature Toggles
ar: تبديل الميزات
de_de: Funktions-Schalter
fr_fr: Activation des fonctionnalités
nl_nl: Functieschakelaars

source: Operation Logging
ar: تسجيل العمليات
de_de: Operations-Protokollierung
fr_fr: Journalisation des opérations
nl_nl: Bewerkingslogboek

source: Enable detailed logging for all operations
ar: تمكين التسجيل التفصيلي لجميع العمليات
de_de: Detaillierte Protokollierung für alle Operationen aktivieren
fr_fr: Activer la journalisation détaillée pour toutes les opérations
nl_nl: Schakel gedetailleerde logboekregistratie in voor alle bewerkingen

source: Logs are stored in the database and can be viewed in the History tab.
ar: يتم تخزين السجلات في قاعدة البيانات ويمكن عرضها في علامة تبويب السجل.
de_de: Protokolle werden in der Datenbank gespeichert und können in der Registerkarte Verlauf angezeigt werden.
fr_fr: Les journaux sont stockés dans la base de données et peuvent être consultés dans l'onglet Historique.
nl_nl: Logboeken worden opgeslagen in de database en kunnen worden bekeken in het tabblad Geschiedenis.

source: AJAX Progress Bar
ar: شريط تقدم AJAX
de_de: AJAX-Fortschrittsbalken
fr_fr: Barre de progression AJAX
nl_nl: AJAX Voortgangsbalk

source: Enable real-time progress updates (recommended)
ar: تمكين تحديثات التقدم في الوقت الفعلي (موصى به)
de_de: Echtzeit-Fortschrittsaktualisierungen aktivieren (empfohlen)
fr_fr: Activer les mises à jour de progression en temps réel (recommandé)
nl_nl: Schakel real-time voortgangsupdates in (aanbevolen)

source: Shows a live progress bar during long operations. Disable if you experience issues.
ar: يعرض شريط تقدم مباشر أثناء العمليات الطويلة. قم بتعطيله إذا واجهت مشاكل.
de_de: Zeigt einen Live-Fortschrittsbalken während langer Operationen an. Deaktivieren Sie dies, wenn Sie Probleme haben.
fr_fr: Affiche une barre de progression en temps réel lors d'opérations longues. Désactivez si vous rencontrez des problèmes.
nl_nl: Toont een live voortgangsbalk tijdens lange bewerkingen. Schakel uit als u problemen ondervindt.

source: Safety Warnings
ar: تحذيرات السلامة
de_de: Sicherheitswarnungen
fr_fr: Avertissements de sécurité
nl_nl: Veiligheidswaarschuwingen

source: Show safety warnings and confirmations
ar: إظهار تحذيرات وتأكيدات السلامة
de_de: Sicherheitswarnungen und Bestätigungen anzeigen
fr_fr: Afficher les avertissements et confirmations de sécurité
nl_nl: Toon veiligheidswaarschuwingen en bevestigingen

source: Recommended to keep enabled to prevent accidental data loss.
ar: يوصى بإبقائه ممكّناً لمنع فقدان البيانات العرضي.
de_de: Es wird empfohlen, dies aktiviert zu lassen, um versehentlichen Datenverlust zu verhindern.
fr_fr: Il est recommandé de garder cette option activée pour éviter la perte accidentelle de données.
nl_nl: Aanbevolen om ingeschakeld te houden om onbedoeld gegevensverlies te voorkomen.

source: Save Settings
ar: حفظ الإعدادات
de_de: Einstellungen speichern
fr_fr: Enregistrer les paramètres
nl_nl: Instellingen Opslaan

source: Are you sure you want to reset all settings to defaults?
ar: هل أنت متأكد من أنك تريد إعادة تعيين جميع الإعدادات إلى القيم الافتراضية؟
de_de: Sind Sie sicher, dass Sie alle Einstellungen auf Standardwerte zurücksetzen möchten?
fr_fr: Êtes-vous sûr de vouloir réinitialiser tous les paramètres aux valeurs par défaut ?
nl_nl: Weet u zeker dat u alle instellingen wilt resetten naar standaardwaarden?

source: Reset to Defaults
ar: إعادة تعيين إلى الافتراضي
de_de: Auf Standardwerte zurücksetzen
fr_fr: Réinitialiser aux valeurs par défaut
nl_nl: Resetten naar Standaardwaarden

source: System Information
ar: معلومات النظام
de_de: Systeminformationen
fr_fr: Informations système
nl_nl: Systeeminformatie

source: Plugin Version
ar: إصدار الإضافة
fr_fr: Version du plugin
nl_nl: Plugin-versie

source: WordPress Version
ar: إصدار ووردبريس
fr_fr: Version de WordPress
nl_nl: WordPress-versie

source: PHP Version
ar: إصدار PHP
fr_fr: Version de PHP
nl_nl: PHP-versie

source: Memory Limit
ar: حد الذاكرة
de_de: Speicherlimit
fr_fr: Limite de mémoire
nl_nl: Geheugenlimiet

source: Max Execution Time
ar: الحد الأقصى لوقت التنفيذ
de_de: Maximale Ausführungszeit
fr_fr: Temps d'exécution maximum
nl_nl: Max. Uitvoertijd

source: Pro Status
ar: حالة النسخة الاحترافية
fr_fr: Statut Pro

source: Active
ar: نشط
de_de: Aktiv
fr_fr: Actif
nl_nl: Actief

source: Free Version
ar: النسخة المجانية
de_de: Kostenlose Version
fr_fr: Version gratuite
nl_nl: Gratis Versie

source: Your Name
fr_fr: Votre Nom
