Repository: Hugo-Venter/Universal-Replace-Engine
Catalog: languages/universal-replace-engine-*.po
Languages: ar, de_de, fr_fr, nl_nl

source: Universal Replace Engine
ar: محرك الاستبدال الشامل
de_de: Universelle Ersetzungsmaschine
fr_fr: Moteur de Remplacement Universel
nl_nl: Universele Vervangingsmotor

source: Enterprise-grade search and replace for WordPress. Content & database operations, SQL backups, multisite support, GUID protection, saved profiles, and Pro regex mode.
ar: أداة بحث واستبدال احترافية لووردبريس. عمليات المحتوى وقاعدة البيانات، نسخ احتياطية SQL، دعم المواقع المتعددة، حماية GUID، ملفات التعريف المحفوظة، ووضع Regex الاحترافي.
de_de: Professionelles Suchen und Ersetzen für WordPress. Inhalts- und Datenbankoperationen, SQL-Backups, Multisite-Unterstützung, GUID-Schutz, gespeicherte Profile und Pro-Regex-Modus.
fr_fr: Recherche et remplacement de niveau professionnel pour WordPress. Opérations de contenu et de base de données, sauvegardes SQL, support multisite, protection GUID, profils enregistrés et mode regex Pro.
nl_nl: Professioneel zoeken en vervangen voor WordPress. Inhoud- en databasebewerkingen, SQL-backups, multisite-ondersteuning, GUID-bescherming, opgeslagen profielen en Pro regex-modus.

source: Security check failed.
ar: فشل فحص الأمان.
de_de: Sicherheitsprüfung fehlgeschlagen.
fr_fr: Échec de la vérification de sécurité.
nl_nl: Beveiligingscontrole mislukt.

source: You do not have permission to perform this action.
ar: ليس لديك صلاحية لتنفيذ هذا الإجراء.
de_de: Sie haben keine Berechtigung, diese Aktion auszuführen.
fr_fr: Vous n'avez pas la permission d'effectuer cette action.
nl_nl: U heeft geen toestemming om deze actie uit te voeren.

source: Advanced scopes (Post Meta, Elementor, All Locations) require Pro version. Falling back to Post Content.
ar: النطاقات المتقدمة (حقول المنشورات، Elementor، جميع المواقع) تتطلب النسخة الاحترافية. سيتم التراجع إلى محتوى المنشور.
de_de: Erweiterte Bereiche (Post-Meta, Elementor, Alle Orte) erfordern die Pro-Version. Es wird auf Beitragsinhalt zurückgegriffen.
fr_fr: Les portées avancées (Méta des articles, Elementor, Tous les emplacements) nécessitent la version Pro. Retour au Contenu de l'article.
nl_nl: Geavanceerde bereiken (Post Meta, Elementor, Alle Locaties) vereisen de Pro-versie. Terugvallen op Berichtinhoud.

source: Please enter a search term.
ar: الرجاء إدخال مصطلح البحث.
de_de: Bitte geben Sie einen Suchbegriff ein.
fr_fr: Veuillez entrer un terme de recherche.
nl_nl: Voer een zoekterm in.

source: No matches found.
ar: لم يتم العثور على تطابقات.
de_de: Keine Übereinstimmungen gefunden.
fr_fr: Aucune correspondance trouvée.
nl_nl: Geen overeenkomsten gevonden.

source: Found %d match(es). Review below and click "Apply Changes" to proceed.
ar: تم العثور على %d تطابق. راجع أدناه وانقر على "تطبيق التغييرات" للمتابعة.
de_de: %d Übereinstimmung(en) gefunden. Überprüfen Sie die Ergebnisse unten und klicken Sie auf "Änderungen anwenden", um fortzufahren.
fr_fr: %d correspondance(s) trouvée(s). Vérifiez ci-dessous et cliquez sur « Appliquer les modifications » pour continuer.
nl_nl: %d overeenkomst(en) gevonden. Controleer hieronder en klik op "Wijzigingen Toepassen" om door te gaan.

source: Preview data expired. Please run preview again.
ar: انتهت صلاحية بيانات المعاينة. يرجى تشغيل المعاينة مرة أخرى.
de_de: Vorschaudaten abgelaufen. Bitte führen Sie die Vorschau erneut aus.
fr_fr: Les données de prévisualisation ont expiré. Veuillez relancer la prévisualisation.
nl_nl: Voorbeeldgegevens verlopen. Voer het voorbeeld opnieuw uit.

source: Successfully modified %d post(s).
ar: تم تعديل %d منشور بنجاح.
de_de: %d Beitrag/Beiträge erfolgreich geändert.
fr_fr: %d article(s) modifié(s) avec succès.
nl_nl: %d bericht(en) succesvol gewijzigd.

source: Invalid log ID.
ar: معرف السجل غير صالح.
de_de: Ungültige Protokoll-ID.
fr_fr: ID de journal invalide.
nl_nl: Ongeldig log-ID.

source: Search & Replace
ar: بحث واستبدال
de_de: Suchen und Ersetzen
fr_fr: Rechercher et Remplacer
nl_nl: Zoeken en Vervangen

source: Database Search
ar: البحث في قاعدة البيانات
de_de: Datenbanksuche
fr_fr: Recherche dans la Base de Données
nl_nl: Database Zoeken

source: Backup
ar: نسخ احتياطي
de_de: Sicherung
fr_fr: Sauvegarde

source: Settings
ar: الإعدادات
de_de: Einstellungen
fr_fr: Paramètres
nl_nl: Instellingen

source: Help
ar: مساعدة
de_de: Hilfe
fr_fr: Aide

source: Search and Replace
ar: بحث واستبدال
de_de: Suchen und Ersetzen
fr_fr: Rechercher et Remplacer
nl_nl: Zoeken en Vervangen

source: Search for
ar: بحث عن
de_de: Suchen nach
fr_fr: Rechercher
nl_nl: Zoeken naar

source: Enter the text you want to search for.
ar: أدخل النص الذي تريد البحث عنه.
de_de: Geben Sie den Text ein, nach dem Sie suchen möchten.
fr_fr: Entrez le texte que vous souhaitez rechercher.
nl_nl: Voer de tekst in waarnaar u wilt zoeken.

source: Replace with
ar: استبدال بـ
de_de: Ersetzen durch
fr_fr: Remplacer par
nl_nl: Vervangen door

source: Enter the replacement text (leave empty to only search).
ar: أدخل نص الاستبدال (اتركه فارغاً للبحث فقط).
de_de: Geben Sie den Ersatztext ein (leer lassen, um nur zu suchen).
fr_fr: Entrez le texte de remplacement (laissez vide pour rechercher uniquement).
nl_nl: Voer de vervangende tekst in (laat leeg om alleen te zoeken).

source: Search Scope
ar: نطاق البحث
de_de: Suchbereich
fr_fr: Portée de recherche
nl_nl: Zoekbereik

source: Post Content
ar: محتوى المنشور
de_de: Beitragsinhalt
fr_fr: Contenu de l'article
nl_nl: Berichtinhoud

source: (post_content field only)
ar: (حقل post_content فقط)
de_de: (nur post_content Feld)
fr_fr: (champ post_content uniquement)
nl_nl: (alleen post_content veld)

source: Post Meta
ar: حقول المنشور
de_de: Beitrags-Metadaten
fr_fr: Méta de l'article
nl_nl: Bericht Meta

source: (custom fields, excluding Elementor)
ar: (الحقول المخصصة، باستثناء Elementor)
de_de: (benutzerdefinierte Felder, außer Elementor)
fr_fr: (champs personnalisés, hors Elementor)
nl_nl: (aangepaste velden, exclusief Elementor)

source: Elementor Data
ar: بيانات Elementor
de_de: Elementor-Daten
fr_fr: Données Elementor
nl_nl: Elementor Gegevens

source: (_elementor_data JSON field)
ar: (حقل _elementor_data JSON)
de_de: (_elementor_data JSON-Feld)
fr_fr: (champ JSON _elementor_data)
nl_nl: (_elementor_data JSON veld)

source: All Locations
ar: جميع المواقع
de_de: Alle Orte
fr_fr: Tous les emplacements
nl_nl: Alle Locaties

source: (content + postmeta + Elementor)
ar: (المحتوى + حقول المنشور + Elementor)
de_de: (Inhalt + Postmeta + Elementor)
fr_fr: (contenu + postmeta + Elementor)
nl_nl: (inhoud + postmeta + Elementor)

source: Choose where to search and replace.
ar: اختر أين تريد البحث والاستبدال.
de_de: Wählen Sie aus, wo gesucht und ersetzt werden soll.
fr_fr: Choisissez où rechercher et remplacer.
nl_nl: Kies waar u wilt zoeken en vervangen.

source: Upgrade to Pro to unlock Post Meta, Elementor Data, and All Locations scopes.
ar: قم بالترقية إلى النسخة الاحترافية لفتح نطاقات حقول المنشور وبيانات Elementor وجميع المواقع.
de_de: Upgraden Sie auf Pro, um Beitrags-Metadaten, Elementor-Daten und Alle-Orte-Bereiche freizuschalten.
fr_fr: Passez à la version Pro pour débloquer les portées Méta de l'article, Données Elementor et Tous les emplacements.
nl_nl: Upgrade naar Pro om Bericht Meta, Elementor Gegevens en Alle Locaties bereiken te ontgrendelen.

source: Post Types
ar: أنواع المنشورات
de_de: Beitragstypen
fr_fr: Types d'articles
nl_nl: Berichttypen

source: Select which post types to search in.
ar: اختر أنواع المنشورات التي تريد البحث فيها.
de_de: Wählen Sie aus, in welchen Beitragstypen gesucht werden soll.
fr_fr: Sélectionnez les types d'articles dans lesquels rechercher.
nl_nl: Selecteer in welke berichttypen u wilt zoeken.

source: Options
ar: خيارات
de_de: Optionen
nl_nl: Opties

source: Case sensitive
ar: حساس لحالة الأحرف
de_de: Groß-/Kleinschreibung beachten
fr_fr: Sensible à la casse
nl_nl: Hoofdlettergevoelig

source: Regex mode
ar: وضع Regex
de_de: Regex-Modus
fr_fr: Mode regex
nl_nl: Regex-modus

source: Regex mode (Pro feature)
ar: وضع Regex (ميزة احترافية)
de_de: Regex-Modus (Pro-Funktion)
fr_fr: Mode regex (fonctionnalité Pro)
nl_nl: Regex-modus (Pro-functie)

source: Run Preview
ar: تشغيل المعاينة
de_de: Vorschau ausführen
fr_fr: Lancer la prévisualisation
nl_nl: Voorbeeld Uitvoeren

source: Apply Changes
ar: تطبيق التغييرات
de_de: Änderungen Anwenden
fr_fr: Appliquer les Modifications
nl_nl: Wijzigingen Toepassen

source: Preview Results
ar: نتائج المعاينة
de_de: Vorschau-Ergebnisse
fr_fr: Résultats de la prévisualisation
nl_nl: Voorbeeldresultaten

source: Showing %1$d of %2$d matches (Free version limit).
ar: عرض %1$d من %2$d تطابق (حد النسخة المجانية).
de_de: Zeige %1$d von %2$d Übereinstimmungen (Limit der kostenlosen Version).
fr_fr: Affichage de %1$d sur %2$d correspondances (limite de la version gratuite).
nl_nl: %1$d van %2$d overeenkomsten weergegeven (gratis versielimiet).

source: Showing all %d matches (unlimited preview in Pro version).
ar: عرض جميع %d تطابق (معاينة غير محدودة في النسخة الاحترافية).
de_de: Zeige alle %d Übereinstimmungen (unbegrenzte Vorschau in der Pro-Version).
fr_fr: Affichage de toutes les %d correspondances (prévisualisation illimitée dans la version Pro).
nl_nl: Alle %d overeenkomsten weergegeven (onbeperkt voorbeeld in Pro-versie).

source: Location
ar: الموقع
de_de: Ort
fr_fr: Emplacement
nl_nl: Locatie

source: Before
ar: قبل
de_de: Vorher
fr_fr: Avant
nl_nl: Voor

source: After
ar: بعد
de_de: Nachher
fr_fr: Après
nl_nl: Na

source: %1$s (ID: %2$d)
ar: %1$s (المعرف: %2$d)

source: Search only
ar: بحث فقط
de_de: Nur suchen
fr_fr: Recherche uniquement
nl_nl: Alleen zoeken

source: History (Last %d Operations)
ar: السجل (آخر %d عملية)
de_de: Verlauf (Letzte %d Operationen)
fr_fr: Historique (Les %d dernières opérations)
nl_nl: Geschiedenis (Laatste %d Bewerkingen)

source: History (Last 5 Operations)
ar: السجل (آخر 5 عمليات)
de_de: Verlauf (Letzte 5 Operationen)
fr_fr: Historique (Les 5 dernières opérations)
nl_nl: Geschiedenis (Laatste 5 Bewerkingen)

source: Unlock Pro Features
ar: فتح الميزات الاحترافية
de_de: Pro-Funktionen freischalten
fr_fr: Débloquer les fonctionnalités Pro
nl_nl: Ontgrendel Pro-functies

source: Search and replace in postmeta, options, and term meta
ar: البحث والاستبدال في حقول المنشورات والخيارات وحقول التصنيفات
de_de: Suchen und Ersetzen in Postmeta, Optionen und Term-Meta
fr_fr: Rechercher et remplacer dans postmeta, options et term meta
nl_nl: Zoek en vervang in postmeta, opties en term meta

source: Elementor page builder support
ar: دعم منشئ الصفحات Elementor
de_de: Elementor Page Builder-Unterstützung
fr_fr: Support du constructeur de pages Elementor
nl_nl: Elementor page builder ondersteuning

source: ACF custom fields support
ar: دعم حقول ACF المخصصة
de_de: ACF benutzerdefinierte Felder-Unterstützung
fr_fr: Support des champs personnalisés ACF
nl_nl: ACF aangepaste velden ondersteuning

source: Unlimited preview results
ar: نتائج معاينة غير محدودة
de_de: Unbegrenzte Vorschau-Ergebnisse
fr_fr: Résultats de prévisualisation illimités
nl_nl: Onbeperkte voorbeeldresultaten

source: Full regex mode
ar: وضع Regex الكامل
de_de: Vollständiger Regex-Modus
fr_fr: Mode regex complet
nl_nl: Volledige regex-modus

source: WP-CLI commands
ar: أوامر WP-CLI
de_de: WP-CLI-Befehle
fr_fr: Commandes WP-CLI
nl_nl: WP-CLI commando's

source: Multisite support
ar: دعم المواقع المتعددة
de_de: Multisite-Unterstützung
fr_fr: Support multisite
nl_nl: Multisite-ondersteuning

source: No operations recorded yet.
ar: لم يتم تسجيل أي عمليات بعد.
de_de: Noch keine Operationen aufgezeichnet.
fr_fr: Aucune opération enregistrée pour le moment.
nl_nl: Nog geen bewerkingen vastgelegd.

source: Date/Time
ar: التاريخ/الوقت
de_de: Datum/Uhrzeit
fr_fr: Date/Heure
nl_nl: Datum/Tijd

source: User
ar: المستخدم
de_de: Benutzer
fr_fr: Utilisateur
nl_nl: Gebruiker

source: Summary
ar: الملخص
de_de: Zusammenfassung
fr_fr: Résumé
nl_nl: Samenvatting

source: Actions
ar: الإجراءات
de_de: Aktionen
nl_nl: Acties

source: Are you sure you want to undo this operation?
ar: هل أنت متأكد من أنك تريد التراجع عن هذه العملية؟
de_de: Sind Sie sicher, dass Sie diese Operation rückgängig machen möchten?
fr_fr: Êtes-vous sûr de vouloir annuler cette opération ?
nl_nl: Weet u zeker dat u deze bewerking ongedaan wilt maken?

source: Undo
ar: تراجع
de_de: Rückgängig
fr_fr: Annuler
nl_nl: Ongedaan maken

source: N/A
ar: غير متوفر
de_de: N/V
nl_nl: N.v.t.

source: Please select at least one table to backup.
ar: يرجى اختيار جدول واحد على الأقل للنسخ الاحتياطي.
de_de: Bitte wählen Sie mindestens eine Tabelle für die Sicherung aus.
fr_fr: Veuillez sélectionner au moins une table à sauvegarder.
nl_nl: Selecteer minimaal één tabel voor een back-up.

source: Backup created successfully! %1$d tables backed up (%2$.2f MB).
ar: تم إنشاء النسخة الاحتياطية بنجاح! تم نسخ %1$d جدول احتياطياً (%2$.2f ميجابايت).
de_de: Sicherung erfolgreich erstellt! %1$d Tabellen gesichert (%2$.2f MB).
fr_fr: Sauvegarde créée avec succès ! %1$d tables sauvegardées (%2$.2f Mo).
nl_nl: Back-up succesvol aangemaakt! %1$d tabellen geback-upt (%2$.2f MB).

source: Invalid backup filename.
ar: اسم ملف النسخة الاحتياطية غير صالح.
de_de: Ungültiger Sicherungsdateiname.
fr_fr: Nom de fichier de sauvegarde invalide.
nl_nl: Ongeldige back-up bestandsnaam.

source: Please select at least one table.
ar: يرجى اختيار جدول واحد على الأقل.
de_de: Bitte wählen Sie mindestens eine Tabelle aus.
fr_fr: Veuillez sélectionner au moins une table.
nl_nl: Selecteer minimaal één tabel.

source: Found %1$d potential changes across %2$d tables. Review below.
ar: تم العثور على %1$d تغيير محتمل عبر %2$d جدول. راجع أدناه.
de_de: %1$d potenzielle Änderungen in %2$d Tabellen gefunden. Überprüfen Sie diese unten.
fr_fr: %1$d modifications potentielles trouvées dans %2$d tables. Vérifiez ci-dessous.
nl_nl: %1$d mogelijke wijzigingen gevonden in %2$d tabellen. Controleer hieronder.

source: No matches found in selected tables.
ar: لم يتم العثور على تطابقات في الجداول المحددة.
de_de: Keine Übereinstimmungen in den ausgewählten Tabellen gefunden.
fr_fr: Aucune correspondance trouvée dans les tables sélectionnées.
nl_nl: Geen overeenkomsten gevonden in geselecteerde tabellen.

source: Database operation: Replaced "%1$s" with "%2$s" in %3$d rows across %4$d tables.
ar: عملية قاعدة البيانات: تم استبدال "%1$s" بـ "%2$s" في %3$d صف عبر %4$d جدول.
de_de: Datenbankoperation: "%1$s" wurde durch "%2$s" in %3$d Zeilen über %4$d Tabellen ersetzt.
fr_fr: Opération de base de données : Remplacement de « %1$s » par « %2$s » dans %3$d lignes sur %4$d tables.
nl_nl: Databasebewerking: "%1$s" vervangen door "%2$s" in %3$d rijen over %4$d tabellen.

source: Successfully updated %1$d rows across %2$d tables.
ar: تم تحديث %1$d صف بنجاح عبر %2$d جدول.
de_de: %1$d Zeilen in %2$d Tabellen erfolgreich aktualisiert.
fr_fr: %1$d lignes mises à jour avec succès sur %2$d tables.
nl_nl: %1$d rijen succesvol bijgewerkt over %2$d tabellen.

source: No changes were made.
ar: لم يتم إجراء أي تغييرات.
de_de: Es wurden keine Änderungen vorgenommen.
fr_fr: Aucune modification n'a été effectuée.
nl_nl: Er zijn geen wijzigingen aangebracht.

source: No settings data received.
ar: لم يتم استلام بيانات الإعدادات.
de_de: Keine Einstellungsdaten empfangen.
fr_fr: Aucune donnée de paramètres reçue.
nl_nl: Geen instellingsgegevens ontvangen.

source: Settings saved successfully.
ar: تم حفظ الإعدادات بنجاح.
de_de: Einstellungen erfolgreich gespeichert.
fr_fr: Paramètres enregistrés avec succès.
nl_nl: Instellingen succesvol opgeslagen.

source: Failed to save settings. Please try again.
ar: فشل حفظ الإعدادات. يرجى المحاولة مرة أخرى.
de_de: Fehler beim Speichern der Einstellungen. Bitte versuchen Sie es erneut.
fr_fr: Échec de l'enregistrement des paramètres. Veuillez réessayer.
nl_nl: Kan instellingen niet opslaan. Probeer het opnieuw.

source: Settings have been reset to defaults.
ar: تم إعادة تعيين الإعدادات إلى القيم الافتراضية.
de_de: Die Einstellungen wurden auf Standardwerte zurückgesetzt.
fr_fr: Les paramètres ont été réinitialisés aux valeurs par défaut.
nl_nl: Instellingen zijn teruggezet naar standaardwaarden.

source: Failed to reset settings. Please try again.
ar: فشلت إعادة تعيين الإعدادات. يرجى المحاولة مرة أخرى.
de_de: Fehler beim Zurücksetzen der Einstellungen. Bitte versuchen Sie es erneut.
fr_fr: Échec de la réinitialisation des paramètres. Veuillez réessayer.
nl_nl: Kan instellingen niet resetten. Probeer het opnieuw.

source: Please enter a profile name.
ar: يرجى إدخال اسم ملف التعريف.
de_de: Bitte geben Sie einen Profilnamen ein.
fr_fr: Veuillez entrer un nom de profil.
nl_nl: Voer een profielnaam in.

source: Profile "%s" saved successfully.
ar: تم حفظ ملف التعريف "%s" بنجاح.
de_de: Profil "%s" erfolgreich gespeichert.
fr_fr: Profil « %s » enregistré avec succès.
nl_nl: Profiel "%s" succesvol opgeslagen.

source: Failed to save profile. Please try again.
ar: فشل حفظ ملف التعريف. يرجى المحاولة مرة أخرى.
de_de: Fehler beim Speichern des Profils. Bitte versuchen Sie es erneut.
fr_fr: Échec de l'enregistrement du profil. Veuillez réessayer.
nl_nl: Kan profiel niet opslaan. Probeer het opnieuw.

source: Please select a profile to load.
ar: يرجى تحديد ملف تعريف لتحميله.
de_de: Bitte wählen Sie ein Profil zum Laden aus.
fr_fr: Veuillez sélectionner un profil à charger.
nl_nl: Selecteer een profiel om te laden.

source: Profile not found.
ar: لم يتم العثور على ملف التعريف.
de_de: Profil nicht gefunden.
fr_fr: Profil introuvable.
nl_nl: Profiel niet gevonden.

source: Profile "%s" loaded successfully. Review the settings below and click Preview or Apply.
ar: تم تحميل ملف التعريف "%s" بنجاح. راجع الإعدادات أدناه وانقر على المعاينة أو التطبيق.
de_de: Profil "%s" erfolgreich geladen. Überprüfen Sie die Einstellungen unten und klicken Sie auf Vorschau oder Anwenden.
fr_fr: Profil « %s » chargé avec succès. Vérifiez les paramètres ci-dessous et cliquez sur Prévisualiser ou Appliquer.
nl_nl: Profiel "%s" succesvol geladen. Controleer de onderstaande instellingen en klik op Voorbeeld of Toepassen.

source: Please select a profile to delete.
ar: يرجى تحديد ملف تعريف لحذفه.
de_de: Bitte wählen Sie ein Profil zum Löschen aus.
fr_fr: Veuillez sélectionner un profil à supprimer.
nl_nl: Selecteer een profiel om te verwijderen.

source: Profile "%s" deleted successfully.
ar: تم حذف ملف التعريف "%s" بنجاح.
de_de: Profil "%s" erfolgreich gelöscht.
fr_fr: Profil « %s » supprimé avec succès.
nl_nl: Profiel "%s" succesvol verwijderd.

source: Failed to delete profile. Please try again.
ar: فشل حذف ملف التعريف. يرجى المحاولة مرة أخرى.
de_de: Fehler beim Löschen des Profils. Bitte versuchen Sie es erneut.
fr_fr: Échec de la suppression du profil. Veuillez réessayer.
nl_nl: Kan profiel niet verwijderen. Probeer het opnieuw.

source: Database Search & Replace
ar: البحث والاستبدال في قاعدة البيانات
de_de: Datenbank Suchen & Ersetzen
fr_fr: Recherche et remplacement dans la base de données
nl_nl: Database Zoeken en Vervangen

source: Backup & Restore
ar: النسخ الاحتياطي والاستعادة
de_de: Sicherung & Wiederherstellung
fr_fr: Sauvegarde et restauration
nl_nl: Back-up en Herstellen

source: URE Settings
ar: إعدادات URE
de_de: URE-Einstellungen
fr_fr: Paramètres URE
nl_nl: URE Instellingen

source: URE Help
ar: مساعدة URE
de_de: URE-Hilfe
fr_fr: Aide URE
nl_nl: URE Hulp

source: Insufficient permissions.
ar: صلاحيات غير كافية.
de_de: Unzureichende Berechtigungen.
fr_fr: Permissions insuffisantes.
nl_nl: Onvoldoende rechten.

source: Search term is required.
ar: مصطلح البحث مطلوب.
de_de: Suchbegriff ist erforderlich.
fr_fr: Le terme de recherche est requis.
nl_nl: Zoekterm is verplicht.

source: Replaced "%1$s" with "%2$s" in %3$d posts.
ar: تم استبدال "%1$s" بـ "%2$s" في %3$d منشور.
de_de: "%1$s" wurde durch "%2$s" in %3$d Beiträgen ersetzt.
fr_fr: Remplacement de « %1$s » par « %2$s » dans %3$d articles.
nl_nl: "%1$s" vervangen door "%2$s" in %3$d berichten.

source: Operation ID is required.
ar: معرف العملية مطلوب.
de_de: Operations-ID ist erforderlich.
fr_fr: L'ID de l'opération est requis.
nl_nl: Bewerkings-ID is verplicht.

source: Operation not found or expired.
ar: لم يتم العثور على العملية أو انتهت صلاحيتها.
de_de: Operation nicht gefunden oder abgelaufen.
fr_fr: Opération introuvable ou expirée.
nl_nl: Bewerking niet gevonden of verlopen.

source: No tables specified for backup.
ar: لم يتم تحديد جداول للنسخ الاحتياطي.
de_de: Keine Tabellen für die Sicherung angegeben.
fr_fr: Aucune table spécifiée pour la sauvegarde.
nl_nl: Geen tabellen opgegeven voor back-up.

source: Could not create backup file.
ar: تعذر إنشاء ملف النسخة الاحتياطية.
de_de: Sicherungsdatei konnte nicht erstellt werden.
fr_fr: Impossible de créer le fichier de sauvegarde.
nl_nl: Kan back-upbestand niet aanmaken.

source: Backup created successfully.
ar: تم إنشاء النسخة الاحتياطية بنجاح.
de_de: Sicherung erfolgreich erstellt.
fr_fr: Sauvegarde créée avec succès.
nl_nl: Back-up succesvol aangemaakt.

source: Unknown
ar: غير معروف
de_de: Unbekannt
fr_fr: Inconnu
nl_nl: Onbekend

source: Backup not found in metadata.
ar: لم يتم العثور على النسخة الاحتياطية في البيانات الوصفية.
de_de: Sicherung in Metadaten nicht gefunden.
fr_fr: Sauvegarde introuvable dans les métadonnées.
nl_nl: Back-up niet gevonden in metadata.

source: Backup file not found or not readable.
ar: لم يتم العثور على ملف النسخة الاحتياطية أو لا يمكن قراءته.
de_de: Sicherungsdatei nicht gefunden oder nicht lesbar.
fr_fr: Fichier de sauvegarde introuvable ou illisible.
nl_nl: Back-upbestand niet gevonden of niet leesbaar.

source: Could not read backup file.
ar: تعذر قراءة ملف النسخة الاحتياطية.
de_de: Sicherungsdatei konnte nicht gelesen werden.
fr_fr: Impossible de lire le fichier de sauvegarde.
nl_nl: Kan back-upbestand niet lezen.

source: Executed %d queries successfully.
ar: تم تنفيذ %d استعلام بنجاح.
de_de: %d Abfragen erfolgreich ausgeführt.
fr_fr: %d requêtes exécutées avec succès.
nl_nl: %d query's succesvol uitgevoerd.

source: Backup not found.
ar: لم يتم العثور على النسخة الاحتياطية.
de_de: Sicherung nicht gefunden.
fr_fr: Sauvegarde introuvable.
nl_nl: Back-up niet gevonden.

source: Backup deleted successfully.
ar: تم حذف النسخة الاحتياطية بنجاح.
de_de: Sicherung erfolgreich gelöscht.
fr_fr: Sauvegarde supprimée avec succès.
nl_nl: Back-up succesvol verwijderd.

source: Table does not exist.
ar: الجدول غير موجود.
de_de: Tabelle existiert nicht.
fr_fr: La table n'existe pas.
nl_nl: Tabel bestaat niet.

source: Table has no primary key.
ar: الجدول ليس لديه مفتاح أساسي.
de_de: Tabelle hat keinen Primärschlüssel.
fr_fr: La table n'a pas de clé primaire.
nl_nl: Tabel heeft geen primaire sleutel.

source: Error updating row %d
ar: خطأ في تحديث الصف %d
de_de: Fehler beim Aktualisieren der Zeile %d
fr_fr: Erreur lors de la mise à jour de la ligne %d
nl_nl: Fout bij het bijwerken van rij %d

source: Log entry not found.
ar: لم يتم العثور على إدخال السجل.
de_de: Protokolleintrag nicht gefunden.
fr_fr: Entrée de journal introuvable.
nl_nl: Logboekinvoer niet gevonden.

source: No rollback data available.
ar: لا توجد بيانات تراجع متاحة.
de_de: Keine Rollback-Daten verfügbar.
fr_fr: Aucune donnée de restauration disponible.
nl_nl: Geen terugdraaigegevens beschikbaar.

source: Rolled back %1$d post(s) from operation #%2$d.
ar: تم التراجع عن %1$d منشور من العملية #%2$d.
de_de: %1$d Beitrag/Beiträge aus Operation #%2$d rückgängig gemacht.
fr_fr: Restauration de %1$d article(s) depuis l'opération #%2$d.
nl_nl: %1$d bericht(en) teruggedraaid van bewerking #%2$d.

source: Successfully rolled back %d post(s).
ar: تم التراجع بنجاح عن %d منشور.
de_de: %d Beitrag/Beiträge erfolgreich rückgängig gemacht.
fr_fr: %d article(s) restauré(s) avec succès.
nl_nl: %d bericht(en) succesvol teruggedraaid.
